In [2]:
%time import numpy as np
import pandas as pd

Wall time: 0 ns

In [3]:
np.arange(10,10)

array([], dtype=int32)

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
x=data.dropna(inplace=True)

In [12]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
x

In [15]:
x=data.dropna()

In [16]:
x

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(how = "all")

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=0)

Empty DataFrame
Columns: [0, 1, 2, 4]
Index: []

In [24]:
data.dropna(how="all",axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7, 3))

In [26]:
df.dropna(thresh=2)

          0         1         2
0  0.646406  0.889823 -1.048379
1  0.060472  1.904050 -0.568895
2 -0.543430 -0.686387 -0.182366
3  0.094096  0.228224 -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [27]:
df.iloc[:4, 1] = NA

In [28]:
df.iloc[:2, 2] = NA

In [29]:
df

          0         1         2
0  0.646406       NaN       NaN
1  0.060472       NaN       NaN
2 -0.543430       NaN -0.182366
3  0.094096       NaN -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [30]:
df.dropna(thresh=1)

          0         1         2
0  0.646406       NaN       NaN
1  0.060472       NaN       NaN
2 -0.543430       NaN -0.182366
3  0.094096       NaN -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [31]:
df.dropna(thresh=2)

          0         1         2
2 -0.543430       NaN -0.182366
3  0.094096       NaN -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [32]:
df.dropna(thresh=3)

          0         1         2
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [33]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [34]:
df.fillna(0)

          0         1         2
0  0.646406  0.000000  0.000000
1  0.060472  0.000000  0.000000
2 -0.543430  0.000000 -0.182366
3  0.094096  0.000000 -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [35]:
df.fillna(0)

          0         1         2
0  0.646406  0.000000  0.000000
1  0.060472  0.000000  0.000000
2 -0.543430  0.000000 -0.182366
3  0.094096  0.000000 -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [36]:
df

          0         1         2
0  0.646406       NaN       NaN
1  0.060472       NaN       NaN
2 -0.543430       NaN -0.182366
3  0.094096       NaN -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [37]:
df

          0         1         2
0  0.646406       NaN       NaN
1  0.060472       NaN       NaN
2 -0.543430       NaN -0.182366
3  0.094096       NaN -1.661635
4  0.125259  0.998606  0.068761
5  0.496012 -1.362709 -3.020053
6  1.169145 -0.309299 -0.023004

In [38]:
df= pd.DataFrame(np.random.randn(6, 3))

In [39]:
df

          0         1         2
0 -1.656070  0.307022 -1.009913
1  0.845147 -0.355006  1.763060
2  0.059642 -1.534692 -0.841911
3 -0.514032 -1.530449  0.239109
4 -1.180819  1.044504 -0.617442
5 -1.607979 -1.228744 -0.165859

In [40]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [41]:
df

          0         1         2
0 -1.656070  0.307022 -1.009913
1  0.845147 -0.355006  1.763060
2  0.059642       NaN -0.841911
3 -0.514032       NaN  0.239109
4 -1.180819       NaN       NaN
5 -1.607979       NaN       NaN

In [42]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.656070  0.307022 -1.009913
1  0.845147 -0.355006  1.763060
2  0.059642 -0.355006 -0.841911
3 -0.514032 -0.355006  0.239109
4 -1.180819       NaN  0.239109
5 -1.607979       NaN  0.239109

In [43]:
df.fillna(0)

          0         1         2
0 -1.656070  0.307022 -1.009913
1  0.845147 -0.355006  1.763060
2  0.059642  0.000000 -0.841911
3 -0.514032  0.000000  0.239109
4 -1.180819  0.000000  0.000000
5 -1.607979  0.000000  0.000000

In [44]:
df.fillna(df.mean())

          0         1         2
0 -1.656070  0.307022 -1.009913
1  0.845147 -0.355006  1.763060
2  0.059642 -0.023992 -0.841911
3 -0.514032 -0.023992  0.239109
4 -1.180819 -0.023992  0.037586
5 -1.607979 -0.023992  0.037586

In [45]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [46]:
data[df.duplicated()]

C:\Users\MUHAMMAD AZHAR\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

Empty DataFrame
Columns: [0, 1, 2, 4]
Index: []

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [48]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
data['v1'] = range(7)

In [53]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [54]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon'
                              , 'Pastrami', 'corned beef', 'Bacon', 
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [55]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [59]:
lowercased=data['food'].str.lower()

lowercased

In [60]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [67]:
meat_to_animal = {
'bacon': 'kow',
'pulled pork': 'kow',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'kow',
'nova lox': 'salmon'
}

In [63]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [68]:
data['animal'] = lowercased.map(meat_to_animal)

In [69]:
data

          food  ounces  animal
0        bacon     4.0     kow
1  pulled pork     3.0     kow
2        bacon    12.0     kow
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     kow
6     pastrami     3.0     cow
7    honey ham     5.0     kow
8     nova lox     6.0  salmon

In [70]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [71]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [72]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.unstack()

AttributeError: 'RangeIndex' object has no attribute 'remove_unused_levels'